---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RebarSystemActiveFrontDirn1
source: html/eae60989-a82b-0837-22be-76badfb4ff31.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RebarSystemActiveFrontDirn1 Property

"Exterior Major Direction"

## Syntax (C#)
```csharp
public static ForgeTypeId RebarSystemActiveFrontDirn1 { get; }
```